"""
Основной модуль приложения
"""

"""
========================================================================
ИНИЦИАЛИЗАЦИЯ И ЗАПУСК ГЛАВНОГО ОКНА
========================================================================
ЧАСТЬ ПРОЕКТА: Карта жизни (Альфа-версия 1.0)
АВТОР: vilfum
ЛИЦЕНЗИЯ: См. файл LICENSE
КОНФИДЕНЦИАЛЬНО: Код и дизайн являются интеллектуальной собственностью автора.
========================================================================
"""

print("app.py loaded")
import sys
from PyQt6.QtWidgets import QApplication
from ui.main_window import MainWindow


def run():
    print("app.run() started")
    app = QApplication(sys.argv)

    window = MainWindow()
    window.show()

    sys.exit(app.exec())
