"""
========================================================================
КАРТА ЖИЗНИ - PERSONAL LIFE MAPPING SYSTEM (Альфа-версия 1.0)
========================================================================
АВТОР: vilfum
ДАТА НАЧАЛА РАЗРАБОТКИ: 17/01/2026
ВЕРСИЯ: 1.0 (Альфа)
ЛИЦЕНЗИЯ: См. файл LICENSE
КОНТАКТ: a.zharikov@hotmail.com
========================================================================

ЛИЦЕНЗИОННОЕ УВЕДОМЛЕНИЕ:
Данная программа находится на стадии активной разработки.
Разрешено только личное некоммерческое тестирование.
Запрещено распространение, модификация и коммерческое использование.
Авторские права © vilfum, 2026. Все права защищены.

ПРОГРАММА ПРЕДОСТАВЛЯЕТСЯ "КАК ЕСТЬ" БЕЗ ГАРАНТИЙ ЛЮБОГО РОДА.
========================================================================
"""

"""
Точка входа в приложение
"""
from app import run

if __name__ == "__main__":
    run()
